{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_1", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_2_weight", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_bias", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_2", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": [[19, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_3_weight", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_3_bias", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_3", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": [[19, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_4_weight", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_4_bias", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_4", 
      "attrs": {"num_hidden": "52"}, 
      "inputs": [[19, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[22, 0, 0], [25, 0, 0], [28, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[32, 0, 0], [35, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    29, 
    30, 
    33
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37
  ], 
  "heads": [[36, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1201]}
}